/*
 *    클래스 영역 
 *    1. 변수 설정 ==> 영화 정보를 모아서 관리 
 *                   Movie[] ...
 *    2. 변수의 초기화 
 *       생성자 / 초기화 블럭 => 초기값 
 *    3. 변수를 어떻게 활용 
 *       메소드 : 목록 / 상세보기 / 예약 / 검색 ... 
 *    --------------------
 *    CGV ==> 메가박스 (약간 변경) => 롯데시네마 
 *    지니뮤직 => 멜론 
 *    
 *    => 영화예매 => 항공기예매 => 맛집 예약 
 *    
 *    class ClassName
 *    {
 *       ------------
 *        변수 선언 
 *        = 인스턴스
 *        = static 
 *       ------------
 *        생성자 / 초기화 블럭 
 *       ------------
 *        메소드 / 기능 설정 
 *       ------------
 *    }
 *    
 *    클래스명 객체명=new 생성자()
 *    인스턴스 => 객체명.변수 , 객체명.메소드 
 *    static => 클래스명.변수 , 클래스명.메소드 
 *    => 모든 클래스는 자신의 객체를 가지고 있다 => this 
 *    -------------------------------------------
 *    
 */
public class 클래스_7 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}