package com.sist.main;
/*
 *   206page 
 *                오버로딩          오버라이딩 => 면접 99.7%
 *  상태           한개의 클래스내      상속을 받은 클래스
 *  메소드          동일                동일
 *  매개변수        다르다               동일 
 *                데이터형 / 갯수
 *  리턴형          관계없다             동일
 *  접근지정어       관계없다             확대(축소->오류)
 *       private < default < protected < public
 *       => 접근지정어를 잘 모르면 => public을 사용  
 *       
 *   *** 상속없이 오버라이딩이 가능 
 *       => 익명의 클래스 
 *       
 *   캡슐화 => 변수 private , 메소드 public 
 *                         ------------- 읽기 / 쓰기
 *                                    getter   setter
 *   상속 => extends 
 *   
 *   다형성 
 *         오버로딩 / 오버라이딩 (******)
 *         
 *   객체 생성 
 *   클래스 객체명=new 클래스()
 *   상위클래스 객체명 = new 하위클래스() 
 *       => 여러개를 묶어서 하나의 객체로 제어
 *   오버라이딩
 *     상위클래스 객체명 = new 하위클래스()
 *                     --------------
 *                        메소드 제어  
 *     -------- 변수 제어 
 *     
 *   => 상속 예외 조건 
 *      ------------ static , 생성자 , 초기화블럭 
 *      
 *   => 상위 클래스 : 공통적으로 사용되는 변수/메소드 
 *                 ------------
 *      영화 : 상영작 / 상영예정작 / 예매 ...
 *       CGV => 오버라이딩
 *       메가박스 => 오버라이딩
 *       롯데시네마 => 오버라이딩 
 *       
 *      맛집 
 *       망고플레이트 
 *       메뉴판닷컴 
 *       
 *      
 */
public class 상속_3 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}